In [1]:
import pandas as pd 
import matplotlib.pyplot as plt

# Introduction to Joining data with pandas

# inner join by using (.merge()) function

In [39]:
taxi_owners=pd.read_pickle('Datasets/taxi_owners.p')
taxi_veh=pd.read_pickle('Datasets/taxi_vehicles.p')
ward=pd.read_pickle('Datasets/ward.p')
census=pd.read_pickle('Datasets/census.p')
licenses=pd.read_pickle('Datasets/licenses.p')
biz_owners=pd.read_pickle('Datasets/business_owners.p')
cal=pd.read_pickle('Datasets/cta_calendar.p')
ridership=pd.read_pickle('Datasets/cta_ridership.p')
stations=pd.read_pickle('Datasets/stations.p')
zip_demo=pd.read_pickle('Datasets/zip_demo.p')
land_use=pd.read_pickle('Datasets/land_use.p')
census=pd.read_pickle('Datasets/census.p')

In [16]:
# Merge taxi_owners with taxi_veh on the column vid, and save the result to taxi_own_veh.
taxi_own_veh= taxi_owners.merge(taxi_veh,on='vid')
taxi_own_veh.head()
# Set the left and right table suffixes for overlapping columns of the merge to _own and _veh, respectively.
taxi_own_veh=taxi_owners.merge(taxi_veh,on='vid',suffixes=('_own','_veh'))
taxi_own_veh.head()
# Select the fuel_type column from taxi_own_veh and print the value_counts() to find the most popular fuel_types used.
taxi_own_veh['fuel_type'].value_counts()

HYBRID                    2792
GASOLINE                   611
FLEX FUEL                   89
COMPRESSED NATURAL GAS      27
Name: fuel_type, dtype: int64

In [19]:

#Merge wards and census on the ward column and save the result to wards_census.
wards_census=ward.merge(census,on='ward')

,ward,alderman,address_x,zip_x,pop_2000,pop_2010,change,address_y,zip_y
0,1,"Proco ""Joe"" Moreno",2058 NORTH WESTERN AVENUE,60647,52951,56149,6%,2765 WEST SAINT MARY STREET,60647
1,2,Brian Hopkins,1400 NORTH ASHLAND AVENUE,60622,54361,55805,3%,WM WASTE MANAGEMENT 1500,60622
2,3,Pat Dowell,5046 SOUTH STATE STREET,60609,40385,53039,31%,17 EAST 38TH STREET,60653
3,4,William D. Burns,"435 EAST 35TH STREET, 1ST FLOOR",60616,51953,54589,5%,31ST ST HARBOR BUILDING LAKEFRONT TRAIL,60653
4,5,Leslie A. Hairston,2325 EAST 71ST STREET,60649,55302,51455,-7%,JACKSON PARK LAGOON SOUTH CORNELL DRIVE,60637

# One to many relationship

In [26]:
# Starting with the licenses table on the left, 
# merge it to the biz_owners table on the column account, and save the results to a variable named licenses_owners.

licenses.head()
biz_owners.head()

  account first_name  last_name      title
0      10      PEARL    SHERMAN  PRESIDENT
1      10      PEARL    SHERMAN  SECRETARY
2   10002     WALTER     MROZEK    PARTNER
3   10002     CELINA     BYRDAK    PARTNER
4   10005      IRENE  ROSENFELD  PRESIDENT

In [ ]:
# Starting with the licenses table on the left, merge it to the biz_owners table on the column account, and save the results to a variable named licenses_owners.
# Group licenses_owners by title and count the number of accounts for each title. Save the result as counted_df
# Sort counted_df by the number of accounts in descending order, and save this as a variable named sorted_df.
# Use the .head() method to print the first few rows of the sorted_df.

In [32]:
# Starting with the licenses table on the left, merge it to the biz_owners table on the column account, 
# and save the results to a variable named licenses_owners. 
licenses_owners=licenses.merge(biz_owners,on='account')
# Group licenses_owners by title and count the number of accounts for each title. Save the result as counted_df
counted_df=licenses_owners.groupby('title').agg({'account':'count'})
# Sort counted_df by the number of accounts in descending order, and save this as a variable named sorted_df.
sorted_df=counted_df.sort_values('account',ascending=False)
# Use the .head() method to print the first few rows of the sorted_df.
sorted_df.head()

                 account
title
PRESIDENT           6259
SECRETARY           5205
SOLE PROPRIETOR     1658
OTHER               1200
VICE PRESIDENT       970

# Merging Multiple dataframe

In [ ]:
# formula
# df1.merge(df2,on="common column")\ 
      #.merge(df3,on='common column')

Merge the ridership and cal tables together, starting with the ridership table on the left and save the result to the variable ridership_cal. If you code takes too long to run, your merge conditions might be incorrect.

In [5]:
# merging two table using multiple columns
ridership_cal=ridership.merge(cal,on=['year','month','day'])
ridership_cal.head()

  station_id  year  month  day  rides        day_type
0      40010  2019      1    1    576  Sunday/Holiday
1      40080  2019      1    1   1839  Sunday/Holiday
2      40770  2019      1    1   2724  Sunday/Holiday
3      40120  2019      1    1    754  Sunday/Holiday
4      40540  2019      1    1   2175  Sunday/Holiday

In [7]:
# lets add another talbe station 

ridership_cal_station=ridership.merge(cal,on=['year','month','day'])\
                                .merge(stations,on='station_id')

In [22]:
ridership_cal_station[ridership_cal_station['month']==7]

,station_id,year,month,day,rides,day_type,station_name,location
181,40010,2019,7,1,1870,Weekday,Austin-Forest Park,"(41.870851, -87.776812)"
182,40010,2019,7,2,1887,Weekday,Austin-Forest Park,"(41.870851, -87.776812)"
183,40010,2019,7,3,1815,Weekday,Austin-Forest Park,"(41.870851, -87.776812)"
184,40010,2019,7,4,770,Sunday/Holiday,Austin-Forest Park,"(41.870851, -87.776812)"
185,40010,2019,7,5,1244,Weekday,Austin-Forest Park,"(41.870851, -87.776812)"
...,...,...,...,...,...,...,...,...
3127,41660,2019,7,27,11719,Saturday,Lake/State,"(41.884809, -87.627813)"
3128,41660,2019,7,28,8415,Sunday/Holiday,Lake/State,"(41.884809, -87.627813)"
3129,41660,2019,7,29,19540,Weekday,Lake/State,"(41.884809, -87.627813)"
3130,41660,2019,7,30,21453,Weekday,Lake/State,"(41.884809, -87.627813)"
3131,41660,2019,7,31,22374,Weekday,Lake/State,"(41.884809, -87.627813)"

In [28]:
# lest filter in our new talbel where 
#station_name == 'Wilson'
#day_type == 'Weekday'
#month == 7

filter_criteria=((ridership_cal_station['station_name']=='Wilson') &
                (ridership_cal_station['day_type']=='Weekday') &
                (ridership_cal_station['month']==7))

In [23]:

# # Use .loc and the filter to select for rides
# print(ridership_cal_station.loc[filter_criteria,'rides'].sum())
filter_criteria.head()

,station_id,year,month,day,rides,day_type,station_name,location
1641,40540,2019,7,1,6464,Weekday,Wilson,"(41.964273, -87.657588)"
1642,40540,2019,7,2,6491,Weekday,Wilson,"(41.964273, -87.657588)"
1643,40540,2019,7,3,6639,Weekday,Wilson,"(41.964273, -87.657588)"
1645,40540,2019,7,5,4794,Weekday,Wilson,"(41.964273, -87.657588)"
1648,40540,2019,7,8,6351,Weekday,Wilson,"(41.964273, -87.657588)"

In [29]:
#sum of all rides 
print(ridership_cal_station.loc[filter_criteria, 'rides'].sum())

140005

Starting with the licenses table, merge to it the zip_demo table on the zip column. Then merge the resulting table to the wards table on the ward column. Save result of the three merged tables to a variable named licenses_zip_ward.
Group the results of the three merged tables by the column alderman and find the median income.

In [32]:
#merging two tables of licence and zip_demo

licenses_zip_ward=licenses.merge(zip_demo,on='zip')\
                          .merge(ward,on='ward')

In [33]:
licenses_zip_ward.head()

,account,ward,aid,business,address_x,zip_x,income,alderman,address_y,zip_y
0,307071,3,743,REGGIE'S BAR & GRILL,2105 S STATE ST,60616,46340,Pat Dowell,5046 SOUTH STATE STREET,60609
1,11280,3,763,PRIME WAY,2251 S STATE ST 1ST,60616,46340,Pat Dowell,5046 SOUTH STATE STREET,60609
2,15015,3,NaN,"SOUTHVIEW MANOR, INC.",3311 S MICHIGAN AVE,60616,46340,Pat Dowell,5046 SOUTH STATE STREET,60609
3,19168,3,666,BP AMOCO,3101 S MICHIGAN AVE 1ST,60616,46340,Pat Dowell,5046 SOUTH STATE STREET,60609
4,205980,3,763,J & J FISH & CHICKEN,8 E CERMAK RD,60616,46340,Pat Dowell,5046 SOUTH STATE STREET,60609

In [37]:
# gouping and finding the media incame

licenses_zip_ward.groupby('alderman').agg({'income':'median'})

                             income
alderman
Ameya Pawar                 66246.0
Anthony A. Beale            38206.0
Anthony V. Napolitano       82226.0
Ariel E. Reyboras           41307.0
Brendan Reilly             110215.0
Brian Hopkins               87143.0
Carlos Ramirez-Rosa         66246.0
Carrie M. Austin            38206.0
Chris Taliaferro            55566.0
Daniel "Danny" Solis        41226.0
David H. Moore              33304.0
Deborah Mell                66246.0
Debra L. Silverstein        50554.0
Derrick G. Curtis           65770.0
Edward M. Burke             42335.0
Emma M. Mitts               36283.0
George Cardenas             33959.0
Gilbert Villegas            41307.0
Gregory I. Mitchell         24941.0
Harry Osterman              45442.0
Howard B. Brookins, Jr.     33304.0
James Cappleman             79565.0
Jason C. Ervin              41226.0
Joe Moore                   39163.0
John S. Arena               70122.0
Leslie A. Hairston          28024.0
Margaret Laurino            70122.0
Marty Quinn                 67045.0
Matthew J. O'Shea           59488.0
Michael R. Zalewski         42335.0
Michael Scott, Jr.          31445.0
Michelle A. Harris          32558.0
Michelle Smith             100116.0
Milagros "Milly" Santiago   41307.0
Nicholas Sposato            62223.0
Pat Dowell                  46340.0
Patrick Daley Thompson      41226.0
Patrick J. O'Connor         50554.0
Proco "Joe" Moreno          87143.0
Raymond A. Lopez            33959.0
Ricardo Munoz               31445.0
Roberto Maldonado           68223.0
Roderick T. Sawyer          32558.0
Scott Waguespack            68223.0
Susan Sadlowski Garza       38417.0
Tom Tunney                  88708.0
Toni L. Foulkes             27573.0
Walter Burnett, Jr.         87143.0
William D. Burns           107811.0
Willie B. Cochran           28024.0